export const InLawsRu: Record<string, string> = {
	"супруг(?:а)? (ребёнка|дочери|сына)": "зять/невестка",
	"жена (ребёнка|дочери|сына)": "невестка",
	"муж (ребёнка|дочери|сына)": "зять",
	"мать (супруга|жены|мужа)": "тёща",
	"отец (супруга|жены|мужа)": "тесть",
	"родитель (супруга|жены|мужа)": "тесть/тёща",
	"жена (сводн(?:ый|ая) )?(брата|сестры|сиблинга)": "невестка",
	"муж (сводн(?:ый|ая) )?(брата|сестры|сиблинга)": "зять",
	"супруг(?:а)? (сводн(?:ый|ая) )?(брата|сестры|сиблинга)": "зять/невестка",
	"(сводн(?:ый|ая) )?сестра (супруга|жены|мужа)": "золовка",
	"(сводн(?:ый|ая) )?брат (супруга|жены|мужа)": "шурин",
	"(сводн(?:ый|ая) )?сиблинг (супруга|жены|мужа)": "шурин/золовка",
};
